let text_coffee_cat =
`■コーヒーと猫
　　　　　　　　　　滝川　海老郎

　俺は少し前から行きつけの喫茶店がある。コーヒーショップ『シルフィード』だ。
　高校と家の途中から少しそれた道沿いにあり、それなりに客も入る。
　この暑い七月の気温では、冷房の効いた喫茶店は涼むのにも最適だった。
　マスターは四十代のおじさんだけど渋くてそこもいい。

　高校二年普通科三組、山梨、大樹。読み方はタイキ。
　帰宅部のため余裕で放課後に喫茶店によって、ひとりカウンター席に座り一杯のコーヒーを頼み、クラシックのＢＧＭを聞きながら、エンジョイしていた。
　静かに、店内の雰囲気を楽しみながら、ゆっくりコーヒーを味わうのが好きだった。
　過去形なのは、今はちょっと違う楽しみができたからだ。

　俺の左隣には、俺と同じ高校で隣のクラス、二組の真記、マキちゃんが座っているからだ。
　彼女は最近、この喫茶店にふらりと寄ったらしい。
　そこには俺が座っていた。男子の制服はまだ学生服で、パッと見では同じ学校かは分からない。
　女子のセーラー服は学校によって多少なりともデザイン差があるから、俺はすぐに同じ高校だと分かった。
　空いている席は、一番隅の俺の左隣か、おじさんに挟まれて向こう側しかなかった。
　彼女は俺の隣を選んで腰かけた。
　座ると、俺の前側も見えるので、校章も見える。
「あっ」
「うん、同じ高校だと思うよ」
　俺はすぐに返事をした。クラス章もつけているので、どのクラスかも分かる。
　お互いに自己紹介をなんとなくして、そして黙っているという選択肢もあった。
　俺はどちらかといえば、ソロだしコミュ障だし、女の子に免疫がないタイプだ。
　でも彼女は、少し間が空いた後、話し始めた。
「私、こういう喫茶店、あこがれてて」
「ああ」
「それで今まで来たことなくて勇気を出して、ひとりだけど今日、はじめて来たんです」
「うん、それはよかった」
「はい」
　これで満足したのか話をやめた。
　彼女はメニューを見てブレンドのホットコーヒーを注文する。

　しばらく無言で喫茶店内をじろじろしない範囲で眺めたり、雰囲気を楽しんでいた。
　そしてコーヒーが出てきた。
　ミルクと砂糖を入れてかき混ぜる。
「いただきます」
　彼女は軽く口だけで挨拶をして、そっと口を付けた。
「あっ、美味しい」
　やさしい声で、そう言った。
　俺はなんと返事をすればいいか分からないので、とりあえずうなずいておいた。
「大樹君はこの喫茶店、いつもいるの？」
「ああ、毎日じゃないけど、たまに」
「そうなんだ」
「うん」

「コーヒー好きなんだよね？」
「そうだな」
「私も好き。コーヒーもお店の雰囲気も、なんだか好き」
「そりゃよかった」
　なんだか何を話したらいいか分からないけど、向こうから話してくれるから別に問題なかった。
　返事には困るけど、相槌なら適当でもいいし。

　ぽつぽつ、適当な話をして、そして静かになる。その繰り返し。
　そうしているうちに、喫茶店の外側のガラスの前に、ネコがやってきた。
「黒ネコちゃんがきたね」
「うん」
「あの子も常連なのかな」
「ああ、よく見るな、あのガラスの前がお気に入りらしい」
「そうなんだ。お友達なの？」
「いや」
「名前は？」
「確か、ロメオだったかな」
「ロメオ君ね、じゃあ男の子かな」
「そうだと思うよ」
「ふうん」
　ロメオはガラスの前で背を丸めて座り、体を舐めている。
　足が上がっていて肉球が見えていた。
　黒ネコと一口に言っても、実は差があったりする。まず目の色。ロメオは金色だ。なかには緑っぽい子もいる。そして鼻と肉球は奇麗なピンク色。どちらも黒い子のほうが多い。あとは完全な黒ではなくお腹が白いなんてネコもいる。
　ロメオはしばらく眺めたら、どこかへ行ってしまった。
　俺たちも喫茶店を出ることにした。もちろん彼女とは別々だ。


　そんなこんなで、たまに喫茶店に行くとマキちゃんとよく会うようになった。
　最初はぽつぽつだった会話も、少し長く話すようになった。

　そんなある日、今日もロメオが来た。
「ロメオ今日も来たね」
「うん」
　二人でガラス越しに眺めているとロメオが座ったまま俺たちのほうを向いて「ニャー、ニャー」と鳴いた。
「ねぇ大樹君、なんかロメオ呼んでない？」
「珍しいな、まるでごはん頂戴ネコみたいじゃんか」
「そうだね。でも何か用があるのかな」
「ネコにそんなことないと思うけど」
　俺たちは店長に一言、話してから店を出てロメオのところに行った。
　そうするとどうだろう。ロメオは立ち上がって、少し先に進み、後ろを振り返った。
「なんだかついて来いって言ってるみたい」
「そうだな」
　俺とマキちゃんは、二人で顔を見合わせて、どうするって表情をした。
「まぁついて行ってみるか」
「うん」
　俺が言うとマキちゃんが同意した。

　ロメオは何軒分か通りを進んでいく。
　そして後ろを振り返ってから右の路地のほうへ折れた。
「あ、曲がった」
　マキちゃんの実況中継を聞きながら俺たちもついて行く。
　路地は細く人通りもない。

　路地をしばらく進むと、突き当りに着いた。
「わぁ」
　マキちゃんは思わず感嘆の声を上げる。
　なるほど、道の突き当りは左に折れている。
　その道沿いはコンクリートの低い壁になっていて、その向こう側に、川が見えてた。
　その川は奇麗な水が流れていて、水面が光を反射してキラキラ輝いていた。
　ロメオはそのコンクリート壁に登って、その上に座って待っている。
「ロメオちゃん、ここに連れてきてくれたの？」
「にゃぁあ」
　分かっているのかどうか。ロメオが返事をする。
　ネコは普段、人間の話を分かっていない風に見えるが、たまに本当は理解しているんじゃないかっていう風に行動することもあって不思議だ。
　俺とマキちゃんは、そのコンクリートの前に並んで立って川を眺めた。
　コンクリートの背の低い部分は幅が狭く、俺たちはかなり近い位置で立って見ないと、二人で見ることができない。
「あっ」
　マキちゃんが小さい声で、反応する。
　あまりに近かったので、二人の手が、そっと触れていた。
「うん」
　なにか決意をしたみたいな声をマキちゃんが小声でする。
　そのまま手を動かしてきて、俺の右手をマキちゃんの左手がしっかりと握ってきた。
　緊張する。ドキドキする。
　マキちゃんはそのつないだ手を、景色に興奮しているのか、若干左右にゆすったりする。

　そのうち落ち着いてきた。
「本当に、いい景色だねぇ」
　どこかのんびりと、リラックスした声でそう言った。
「うふふ。あっ、喫茶店、お会計まだだったね。戻らなきゃ」
「お、おう」
　そう返事するのが精いっぱいだった。
　もう少し二人でこのままでいたい、なんてとても言えなかった。
　まぁ、また来ればいい、そう思った。


「おお、二人ともお帰り」
「マスター、ただいまです」
「マスター、俺たち。すみません」

「いいって。お、なになに、どうしたのそれ？」
「それって？」
「手なんてつないじゃって、まぁ」

「おおっ」
「きゃっ」

　マキちゃんが手を放して、小さく飛び上がって離れていった。
　少し寂しいがしょうがない。
「ふふ、なんでもありません」
　優しい顔で、いたずらっぽく言うマキちゃんに、俺もマスターも見惚れそうだった。

（了）
`;
