let text_goblin =`
■■転生者ゴブリン初の貴族を目指します
　　　　　　　　　　　　　　　　　　滝川　海老郎

■第1話　ゴブリン村

「ゴブゴブ」

　ここはルフガル。ゴブリン村だ。
　人間の言うところのエルヘレス森の中腹にあるらしい。
　近くに人間の集落はないが、森の麓には人間の村が一つだけある。
　そんな辺鄙な場所だ。

　最初の転生は人間の下級貴族だった。
　比較的裕福で色々な知識を身に着け、それとなく過ごしていた。
　結婚して子供が出来て、それなりに幸せだった。
　そして普通に死んだ。

　再び生まれ変わってみたらゴブリンだった。

　崖にある洞窟がルフガルだ。
　内部は思ったよりは広く入り組んでいる。
　行き止まりがいくつもあったので、それぞれ小部屋のように利用している。
　ゴブリンはこのような生活に適応しているのか、人間よりも目がいい。
　薄暗がりでも、そこそこ見ることができる。

　俺が二歳を過ぎるころ、子供も卒業だと言われた。

「ドルだべ。お前も明日から狩りに行くべ」
「はい、|長《おさ》」

　長はベダだったかな。
　ここのゴブリンの最長老で今年十五だったかと思う。
　ゴブリンの寿命は二十歳くらい。
　野生のゴブリンはもう少し短いかもしれない。

　この世界では野生のゴブリンと、ゴブリン牧場で生まれた町生まれのゴブリンがいる。
　町のゴブリンは奴隷として一生働かされる。

　俺も人間だったころ子爵家生まれだったから、ゴブリンはこき使われているのをよく目にした。
　町中では食堂の皿洗い、雑用。
　一番多いのはプランテーションの農奴だ。
　それから採掘現場での鉱員。
　多くはメス、オス関係なく働かされる。
　単純労働には、ゴブリン。これが定説だった。
　食堂でも配膳は女の子の仕事だ。ゴブリンに任せたりすることはない。
　こうして分担されていた。
　基本的にゴブリンに表の仕事をさせることはない。
　貴族の館クラスになると全員、人間だったりする。中には少数、獣人がいるくらいだろうか。

　言語が同じなのでここが同じ世界であることは明確だった。
　野生のゴブリンにも「人間語」が普及して久しい。
　はるか昔には、ゴブリン語を話していたとエルフの記録があるのだが、ゴブリンを奴隷として使うようになってから、ゴブリンに人間語を教えるようになり、今では野生のゴブリンにまで人間語が普通に話されている。
　野生といっとも細々と人間と交流を持つことがあったのだろう。

　野生のゴブリンは、森や山などの洞窟に住む、いわば原住民だ。
　世界はとても広く、人間のテリトリー外の森なども多数あるので、野生のゴブリンはそういうところに点々と住み着いて、今まで生き延びてきた。
　街のすぐ外に住んでるなんてこともある。

「ドル、こっちだ」
「ああ」

　ゴブリンのリーダーが俺や仲間を連れて狩りに出る。
　手にはお手製の木槍を装備していた。
　先をナイフで削り尖らせてあるが、大した威力はない。
　よく先が折れるので面倒だった。その度に削り直しだ。

　ナイフは昔、死んだり捕虜にしたりした冒険者から回収したものだと伝わっている。
　もうだいぶボロいが、それでもないよりはマシだった。
　ゴブリンに鍛冶仕事は難しい。

「角ウサギだ」
「ゴブブウ」

　一斉に木槍を突いて角ウサギを追い込む。
　ウサギはびっくりして飛び上がり、そのまま走って逃げていく。

「失敗だった、ゴブ」
「だな」

　ゴブリンの普通の狩りは成功率が低い。
　だから交代で何パーティーか組んで一日中付近の森を探索する。
　たまに人間にも遭遇することがある。
　人間と俺たちゴブリンは会話できるにもかかわらず、それほど交流がない。
　そして冒険者はゴブリンの奴隷狩りをすることがある。
　だから俺たちと冒険者は戦闘になることがあった。
　そして女冒険者はゴブリンの捕虜になることがある。
　どうなるかといえば、ふむ。もちろん子供を産んでもらうことになるわけだが……。
　それはまたいずれ話そう。

　今日も一日がかりで角ウサギが三匹なんとか確保できた。
　それから運がいい。

「ククル、ククル、ゴブ」
「おお、美味そうだ」
「とる、とるべ」

　今日はククルの実という赤い果実が豊作だった。
　森の中にところどころに生えているのが、今が旬だった。
　俺たちのパーティー五人でどんどん採っていく。

　いわゆる狩猟採集生活というやつだろう。
　まるで原始人だが、しょせんゴブリンである。
　まあ、そんなものだろう。

　背負い袋にいっぱいにククルの実を収穫すると、ゴブリンが満足気にニヤリと笑った。
　緑の皮膚。短髪の灰色の髪に、しわくちゃな顔。
　そして口元に伸びる牙。
　背は十歳児くらいの身長までしか伸びない。
　雑な草を編んだ服と半ズボンを着ている。
　それからイノシシやオオカミの牙を吊るしたペンダントをしている。

　ゴブリンにも文化らしきものがあり、ペンダントはお洒落なのだ。
　イノシシやオオカミを倒すのは命がけであり、その牙を身に着けるのは、名誉であるとされる。

　俺も戦士になるということで、今朝方、オオカミの牙が一本だけのペンダントを新しく与えられた。
　他のゴブリンたちは複数本の牙をぶら下げていた。
　リーダーのペンダントは中央にイノシシの大きな牙が一つに、たくさんのオオカミの牙が並んでいる。
　ということでペンダントを見れば、そいつがどれくらいの戦士階級か分かるのだった。

■第2話　リーリア

　家の洞窟に戻り夕ご飯とする。

　焚火をしてウサギ三匹を焼いていく。
　味付けは山の上の方で採れる岩塩を砕いた物が使わている。
　野生のゴブリンという割にはグルメなほうなのだろう。

　ククルの実を総勢二十名ほどいる家族に分け与える。
　焼けたウサギも配っていった。
　水は粗末な木のコップを各自で用意する決まりだ。
　洞窟の一番奥の部屋が下へと続いていて地下水が湧き出ているのだ。
　ご飯を分け与えるのは長であるベダの指示で、メスゴブリンのリーダーであるベリアの担当だった。
　ベリアはベダの奥さんで、家族の中で怒らせると一番怖い。
　肝っ玉かあちゃんである。

　いただきますもなければ、挨拶すらない。
　ウサギ肉を受け取ったゴブリンからすぐに食べだす。
　ちなみにもちろん手掴みだし。
　手を洗う習慣もない。

「うま、うむ」
「むぐむぐ」
「ぐふふふ」

　ゴブリンはあまり社交性がないので、風邪とかも移らないらしい。
　あまり病気になることがない。
　頑丈である。
　だから、人間に奴隷として重宝されてきたという歴史もある。
　無理をさせても死なない、病気にならないと便利だったのだ。

「ほら、ドル、食え」
「あ、どうも」

　俺は二人分の食事を受け取ると、焚火の囲いから離れて目的地へと移動する。
　奥から二番目の小部屋には、木の棒で入口がふさがれていて、扉がある。
　つまり牢屋だ。

「リーリア、ご飯だ」
「ありがとう、ドル」
「いいんだ」

　中に入る。そこには金髪碧眼の十六歳の少女、リーリアがいた。
　もちろん人間だ。
　髪はだいぶ痛んでしまっているがそれでもまだ美少女に見える。
　一か月前くらいだろうか。
　彼女はこの森で薬草採取をしていたのだが、俺たちゴブリンに捕まってしまったのだ。

「食べるぞ」
「はい。食事をありがとうございます。エスティーシア神に感謝して」
「神ねぇ」
「ゴブリンに言われる筋合いはないわ」
「そうですかい」

　俺とリーリアだけの食事が始まる。
　彼女は最初、手掴みだったのに少し難色を示したが、今では慣れたのだろう。
　それでも彼女は綺麗好きで、俺に水を持って来させて、食前、食後には手を洗う。
　濡れた布ともいえないような布で、体を毎日拭くことも欠かさない。

　ちなみに彼女の格好は非常にボロい布のような物だ。
　最初は綺麗なワンピースだったのだが、今ではぼろぼろになってしまっている。
　逃げ出そうと檻の間に体をねじ込んだりと、お転婆だったのだ。
　長がその度に、鞭のような枝で叩いて躾けたせいで、こうなっている。

「ごちそうさま」
「ごちそうさま」

　ご飯を食べ終わる挨拶は、俺たち二人とも一緒だった。
　元々は人間が祈る食後の挨拶なのだが、俺は隠しているが元人間だしな。
　他のゴブリンでこういう挨拶をしている奴はいない。

　食事の皿を返して片づけをすると、再び牢に戻る。

「んじゃ、寝るか」
「んっ」

　リーリアが頬を少し赤くして、場所を開けてくる。
　俺は長からリリーアの世話係を任命されている。
　そしてリーリアとは夫婦だと決められていた。
　二歳にもなれば大人なのだ。

「んっ、んん」

　リーリアと抱き合って夜は眠る。
　ゴブリンにはまったく反応しない俺だが、リーリアは美少女である。
　俺だってオスのゴブリンだった。
　リーリアはたまらないいい匂いがする。

　最初こそゴブリンである俺を拒んでいたが、今では抵抗も弱くなった。
　それでもやはり羞恥心はあるようで、嫌がりはする。
　しかし俺はただのゴブリンではなく非常に紳士的なので、優しく、優しく接してやるとリーリアも大人しくなる。


　リーリアが捕まり俺と夫婦になって二か月。

「なんか、気持ちが悪いの」
「そうか」

　リーリアが妊娠した。
　人間とゴブリンのハーフはこの世界ではホブゴブリンと呼ばれている。
　妊娠期間は三か月前後らしい。
　ホブゴブリンは普通のゴブリンより気持ち背が高い。
　またゴブリンよりは平均して賢い。
　肌の色もなんとなく違い、普通のゴブリンが濃い緑系なのに対して少し薄めだ。

　あれよあれよとお腹は大きくなり、子供が生まれた。
　胎児の大きさは人間より小さいので、生みやすいといえば生みやすいのだろう。
　もちろん危険ではあるが、オークとのハーフに比べれたら雲泥の差だ。オークは大きいからな。
　女の子であった。

「グレア」
「グレアね」

　長の命名にみんなで応える。
　グレアがリーリアのおっぱいを一所懸命に吸う。
　小さい子はみんなサルみたいだが、どっちかというとやっぱりゴブリンだった。

■第3話　魔道具

　さて効率の悪い狩りを続けて、何か月か。

「魔道具とか使ったらいいんじゃないかな」

　武器は木槍で碌な攻撃力がない。
　そこで前世の知識を生かして、戦闘用の魔道具を作ろうと考えたのだ。
　野生のゴブリンに本来できることではないが、俺は転生者だし。

　隣でリーリアがグレアの世話をしている。
　それを横目で見つつ、木の棒に魔石を嵌める穴をナイフで削っていく。
　そして俺の血を使って木のペンで、魔石に魔法陣を描いていく。
　といっても初級の火魔法なので簡単な紋様だ。
　これくらいなら暗記していたし、ゴブリンでもできる。

　幸い、ゴブリンの手は小さく、こういう手作業に向いている。
　そのため雑用の奴隷に適しているというのもある。

「えいしょ、えいしょ」
「ぱぱ、ぱぱ」
「ああ、ほら、できたぞ」
「きゃっきゃ」

　俺の手には「火魔法の棒」が完成していた。
　魔力を流すと、先端から火を噴く。

　基本的にゴブリンはほとんど火を熾さない。
　すでにある種火をずっと燃やしていて、そこから分けて使う。
　うっかり夜番が寝てしまったりすると、消えかかっていることがある。
　そうすると長が火魔法でもう一度、火をつけてくれる。

　ここのゴブリンの半数は火種の魔法は使える。
　その中のさらに半分は火魔法がちょっとだけ使える。
　俺とかな。

　ボワワアアア。

　俺が火魔法の棒を使って見せると、目の前に火炎放射のようなものが出て、みんなびっくりしている。

「なんだべ、それ」
「火魔法の棒」
「なんだ、なんだべ」
「魔道具だよ」
「へぇ、すごいな、ドル」

　使ったのは角ウサギの魔石だった。
　普段使わないので、隅の方にゴミみたいに山になっていたのを失敬したのだ。

　俺はこれを量産した。
　ここのメンバーは約二十人。
　そのうち七人がメスだ。オスのほうが生まれやすい。
　しかし多産なので、人口は維持できるのだ。妊娠期間も短いし。
　外回りの戦士チームは五人パーティーが三つとなっている。

　ということでチームあたり三つを装備するべく十個ばかり作成した。
　ひとつはグレア用のおもちゃである。

　ヒーラーの適性があり村の教会で働いていたリーリア。
　その娘なので魔法適性があるのだ。

「バゲは、もう大丈夫でしょう。治ってますね」
「すまない、ゴブ」

　バゲは戦士の一人で、この前、角ウサギの角に当たって、足に怪我を負っていた。
　リーリアの治癒魔法ヒールで治してあげたのだが、そのあとも様子を見ていた。

　この村ではここ三か月、死者がいない。
　その理由の一つに、リーリアの治癒魔法で回復できるからでもあった。
　軽い火傷を治したこともある。

　ということでリーリアは相変わらず檻に捕まっているが、前よりは他のゴブリンからも一目置かれる存在になっていた。

　やはり魔法や魔道具は使えるなら、どんどん活用したほうがいいのだ。
　ゴブリンだ、脳筋だとか言ってられない。

　そして俺たちは実践するべく狩りに出かけた。
　今日はウサギの数が少ない。
　少し焦っていたところ、森の中から陰が飛び出てきた。

「グルルルル」
「オオカミめ」
「くらえ、ファイア」
「おりゃああ、ファイア」

　オオカミに俺たちの火魔法の棒が火を噴く。
　オオカミが燃え上がり、ダメージを与えたのか、なんとか倒すことができた。

「ふぅ、火魔法の棒がなければヤバかったな」
「ドル、これすごい、ドル、やった」
「ああ」

　みんなで大よろこびだ。
　オオカミを解体していく。

　毛皮が手に入った。これはいい。ひさしぶりの大物だ。
　肉もたっぷりある。
　ウサギの肉は脂肪分も少なくササミみたいにタンパクな味だった。
　オオカミ肉はもっと肉肉しく、旨味が強い。
　ご馳走である。

　頭の弱いゴブリンたちは踊りながら帰っていった。
　それを俺があとからのんびりと追う。

　ルフガルに着くと、さっそく夕ご飯の支度だ。
　いつもより少し早い。

　オオカミ肉を焼いていく。
　そしてオオカミをさらに解体していく。
　牙を取る。そのうちの一番大きいのを俺は貰った。
　これは後で紐を通す穴を開けて、アクセサリーに通す。

　ジュワアア。
　いつもより美味しそうな匂いが洞窟に充満している。
　大型のオオカミ一頭分の肉だ。かなりの量があった。
　全員が満足に食べられるだけはある。

　ちなみにゴブリンは狩りが下手でもともと貪食だったので、飢餓に強い。
　そのため奴隷のゴブリンは碌にご飯を与えられない場合もある。
　まったくケチなご主人様もいるものだ。

　それから毛皮。
　これは服がボロボロになってしまったリーリアに与えられることになった。
　人間はゴブリンほど丈夫じゃないし、服の代わりはいるだろう。

■第4話　メスゴブリン

　さて、俺たちオスゴブリンが狩りをしている間、メスたちが何をしているかというと、色々だった。
　主には草を編んでいる。

　近くの少し下ったところにメルセ川があり、そこにアシのような背の高い草が群生している。
　一年中そこから草を刈って洞窟に持ってきては陰干しをする。
　乾燥したところで割と雑に編んでいく。
　これが上着、スボン、リュック、布団になるのだ。

　ただ適当なのと草であるため、耐久性はないに等しく、すぐ駄目になる。
　人数分確保することを考えたら、すぐ予備が必要になって一年中終わらない。

「マッマ、ママ」
「はいはい」

　もちろん、子どもたちの面倒を見ながらだ。

　ただ、俺が魔道具の火魔法の棒を開発してから少し変化があった。
　まず、いままでオオカミが出たときはほぼ逃げ帰ってきていた。それがいまではご馳走に変わった。
　それから大きな違いは、オオカミの毛皮が手に入るようになったのだ。もちろんところどころ焦げていて損傷はあるが、そもそもないのとは違う。
　順番に毛皮の服が与えられるようになったのだ。

「グレア、ほーれ」
「きゃっきゃっ」
「高い、高ーい」
「ごぶぅ！　きゃうう」

　グレアが楽しそうに声を上げる。
　午前中でオオカミを倒した日には、もうその日はお休みだ。
　最近では、獲物が多いので肉が余る程になってきている。
　ゴブリンの巣で遊んだりする時間ができた。
　本当に遊んでいる時間はあまりないが、前より余裕が生まれた。

　オオカミ狩りをした日は先にモツなどを食べる。
　余った肉は今度から塩を振り、陰干しすることで、ジャーキーに仕上げるようになった。
　今まで食料の備蓄などほぼなかったことを考えると格段の進歩だ。

「もぐもぐ、ジャーキーうまっ」
「よかったわね」
「おう、ほら、リーリアも食うか？」
「うん、ありがとう」

　仲睦まじく、オヤツにする。
　きゃっきゃっとグレアが笑った。
　ゴブリンでも思ったりずっと幸せである。

　グレアが生まれるより、だいぶ前の話だが、俺はある提案をした。

「洞窟内は排泄禁止にしよう」
「ゴブゴブ！」
「そ、そうか」
「俺が中心になってトイレ作るからそこでしてくれ」

　今までは割とそのへんで適当に排泄していた。
　しかし洞窟内でされると後で臭う。
　衛生的に考えてよくないだろう。

　洞窟のすぐ脇に穴を掘った。
　木の棒くらいしかないので苦労したが、なんとか完成させた。
　穴の上に木の板を渡して真ん中を空ける。
　ゴブリン村に文明の一つ、トイレができた瞬間であった。

　実は地球でも発展途上国を中心にまだトイレが普及していない地域は普通にある。
　ゴブリンも鼻が高い。どやあ。

　ということでグレアが生まれる前には衛生環境の改善が行われていたのだ。
　そのおかげか、グレアも元気いっぱい、すくすく育っている。
　ママのリーリアもびっくりの成長速度だ。
　人間ちゃんはこんなにすぐ大きくならないからね。
　どちらかというと、ペットや家畜に近い成長速度だろう。

　まだ生まれてそれほど経っていないのに、すでに片言にしゃべるし、もうハイハイを通り越して、よちよち歩き回る。
　ママのミルクもごくごく飲む。成長速度が早い分、大食漢なのだろう。
　お腹はゴブリンよろしくちょっと出てる。
　顔はママ、リーリアの影響なのか、ゴブリンにもかかわらずかなりかわいい。
　最近、乳歯の小さな前歯が生えてきた。かわいい。

「マッマ、パパ」
「ほーい。パパでちゅよぉ」
「きゃっきゃ、ママ、リーリア」
「そうよ、私はリーリア」
「パパ、ドゥル」
「おう、ドルだぞぉ」
「グレア！」
「そうだ、そうだ」
「みんにゃ、ゴブリン」
「そだ。俺たちはゴブリン」
「「「うおおおお」」」

　グレアを囲んで談笑する。
　本当に頭がいい。これでまだ生まれて三か月程度だってんだから。

「ファイニャ」
「うぉっと」

　グレアが指先に火を灯して見せてくれる。
　俺が適当に火魔法を見せてみたらすぐに真似したのだ。
　天才だ。この子は天才。完全に親バカだった。

　普段は割とおとなしい。
　リーリアと一緒に、草を編んだりする。

「んしょ、んしょ」
「ほら、こうやって交互に」
「ん、ううう」

　見様見真似で編んでいく。
　なんというか、やっぱり天才かな。すぐにできるようになった。
　手も小さいため、網目も普通より細かい。
　目が詰まっているため、これはこれで高級品みたいに見える。

「できた！」
「えらいわ」

■第5話　防御の強化と解放

　魔道具、火魔法の棒によって狩りの効率が格段に上昇した。
　それで暇な時間が出来たわけだけど、ずっと遊んでいるわけではない。

　たまには遊ぶこともある。
　例えば、定番と言えばゴブリン相撲だ。
　ゴブリンはバカだけど、運動神経は悪くはない。
　バカといいつつ小賢しいというか、悪知恵は働く。

「よ、ほらほら」
「どうした、どうした」
「いけ、やっちまえ」

　二人のゴブリンが組んで相手を投げ飛ばそうと動く。
　力が互角なのかなかなか決め手にならない。
　しかし片方のゴブリンが側面に回り込み、腰だめで投げた。

「うぉおお」
「あらぁ」

　こうして土に手をついたりほうが負けだ。

「負けちまった」
「あはは」
「きゃっきゃ、デル弱い」
「姫様にそう言われたら、困っちまう」

　グレアはご機嫌だ。
　デルと呼ばれた戦士は頬を掻いて笑顔を浮かべる。
　みんな家族みたいなもので、仲はよいのだ。

　それでだ、時間が出来たので防御力を強化することになった。
　もう少し北の崖には、北のゴブリン一家が住んでいる。
　こういうとき仲良しならいいのだが、基本的に交流もなく、敵でも味方でもない。
　それから森の奥にはオークなども生息している。
　オークは森の原住民で豚人族とも呼ばれる種族だ。亜人である。
　もし襲ってきたらひとたまりもない。
　ゴブリンは食べられたりしないものの、普通に惨殺される。悲しい運命なのだ。
　そうならないように準備をしよう。

　まず入口の内側に少し土地を確保する。
　その外側をぐるっと囲うように、土を掘る。
　掘った土は内側へ積んでいく。
　これで穴と山を同時に作っていく。
　知っている人は分かると思うが日本でも江戸時代以前に作られた土塁だ。
　土で作った簡易的な城壁のようなものだ。

　俺たちはだいぶ暇だったので、せっせと働いた。
　ゴブリンは幸いにも働き者である。単純バカともいうが。

「よいしょ～こらしょ～」

　へこみの底から土塁の上までは約二メートルほどになった。
　これならゴブリンは登ってこれない。

　土塁の上の内側は傾斜になっていて登ることができる、上から火魔法の棒や弓矢で攻撃できる。
　それから石を配置して投石が可能だ。

　人間やゴブリンの共通の能力として、手先が器用、火熾し以外にこの投石がある。
　野球をやっていなくても、ある程度訓練すればだいたい目標地点へ投げられる種族的な能力があるのだ。
　人間も原始時代からこうして戦ってきた。

「よし、訓練をやるぞ」
「おおお」

　敵が外から来たとして想定する。
　ゴブリンが外から逃げ帰ってくる。
　土塁の中央正面は普通に通路になっていた。
　内側へ入り、左右の土塁へと登っていく。
　そこで準備された火魔法の棒と石で外の敵を一方的に攻撃していく。
　もしかしたら巨体のオークだとぎりぎり上まで届くかもしれないが、それはご愛嬌ということにしよう。
　こうして上から攻撃して、犠牲を減らす。


　さて、リーリアとグレアなのだけど、もう三か月経ちグレアもお留守番ができるようになった。

「リーリアを解放する」
「え、いいの？」
「ああ。グレアが人質となる」
「あぁそういうこと」
「そういうことだ」

　長が決断をした。

「村へ帰り、商人を連れてきて欲しい」
「あ、うん」

　今のリーリアには子供がいるのだ。無碍には出来まい。

「じゃあ行ってくるわ。グレア、それからドル」
「なんだ、リーリア」
「今まで、お世話をしてくれて、ありがとう」
「いいんだ」
「グレアをお願いね」
「もちろん」

　リーリアと抱き合って、別れを惜しむ。
　リーリアは粗末な草の服の上から毛皮を着ている。
　それからもともと持っていたナイフを装備した。
　他にも捕虜になったときに持っていた水筒などいくつかの冒険者道具を持っていく。

　リーリアのナイフがこのルフガルで一番新しい。

「魔石、持ったな」
「はい」

　奥でくすぶっていた魔石をいくらか持たせた。
　資金にするつもりだ。

「あとは、ジャーキー」
「あるわ」

　余っていたジャーキーも交易品に加える。
　あとは一応、牙のネックレスも持たせてみる。
　オオカミがたくさん取れるようになって牙も数が揃っている。

「行ってきます」

　リーリアが手を振ってルフガルの洞窟から離れていく。
　俺たちゴブリンは見守るだけだ。
　もし帰って来なければ、その時はその時だろう。
　しかしリーリアは優しい。娘を置いていなくなったりしないだろうな。


　リーリアは崖伝いに移動していく。
　メルセ川に出ると、さらに下流へと歩く。

　半日ほどの距離を歩いた。懐かしい生まれ故郷、シャーリア村が見えてきた。
　入口の門番が驚いているのが見える。

「リーリア、リーリアじゃないか。今までどうした？」
「あ、うん、ちょっと色々あって」
「そうか。よかった、よかったな」

　とにかく中に入り、普段お世話になっていた教会へ行った。
　リーリアの両親は他界しており、教会に身を寄せていた。

「神父様」
「リーリア」

　おじいちゃん神父と再会する。

「実はゴブリンに捕まっていたのですが、解放されました。娘もいます」
「そうだったか」
「娘もいますし、ゴブリン村へ戻ります。今回は交易をしたくて、その商人を探してます」
「そうだな冒険者商人のガルドがいいだろう」
「ガルドさんですか、分かりました」

　ガルドはがっちりしたおじさんで、近所の町までよく買い出しに行く。
　冒険者兼商人をしている人だった。
　なるほど、彼なら適任だろう。

■第6話　商人

　一晩、教会に泊まり、久しぶりに人間の普段よりも豪華な食事をした。
　パンを食べたのも久々だ。スープもある。
　それから服を着替えた。

　翌日、神父の案内でガルドに魔石とジャーキー、それから牙のネックレスを見せる。

「ガルドさん、ゴブリンと交易をして欲しくて」
「野生のゴブリンか？」
「はい」
「まあ、いいが、大丈夫なのか？」
「ええ。私を無理に襲ったりはしない程度には」
「そ、そうか」

　魔石はどれも普通品質だが数が百近い。
　これならけっこうな金になる。
　オオカミ肉のジャーキーはしっかり塩も使っているのが評価された。
　牙のネックレスはあまり高いわけではないが、町なら珍しがって買ってくれるかもしれないという。

「ところでジャーキーの塩はどうしてるんだ？」
「山の上から取ってきてます」
「そうか、岩塩があるのか？　人間には知られてないな」
「そうなのですね」
「ああ、できれば塩の取引もしたい」
「わかりました。次から用意させます」

　なるほど、ここは海から離れている。
　生活必需品である塩が比較的高価だった。
　こんなところで採取できるなら、かなり有り難い。

「それで欲しいものは？」
「まずはナイフ。新しいナイフを三つほど」
「ふむ」

　万が一ゴブリンと戦闘になった場合でも考えているのだろうか。
　ガルドが難しい顔をしたが、すぐに普通の真面目な顔に戻る。

「まあ、大丈夫だろう」
「人間を不用意に襲ったりはしません」
「だろうな。今まで被害もほとんどない。リーリア以外にはな」
「ええ」

「小麦を二袋」
「そうだな。ゴブリンが農業するわけないしな」
「パンモドキでもいいので、食生活の改善を」
「苦労してるんだな」
「そうですね」

　食べ物と言えば、ククルのような木の実か肉だった。
　野草の中にもゴブリンが好むものがあり、サラダのようにして食べる。
　スープやパンといった凝った料理はない。

「他に欲しいものは？」
「なにかありますかね？」
「そうだな、うーん、香辛料とか」
「もらいます」

　トウガラシ粉、粉胡椒、オレンジの皮の粉末を購入した。

「それじゃああと、鍋を一つ」
「あぁ鍋ね」

　ゴブリン村には鍋さえない。
　今まで料理も碌にしなかったから問題なかったが、リーリアが料理をするとなれば別だろう。

「まだまだ買えるが、現金にしておくか？」
「そうですね」

　金貨、そして銀貨を受け取る。

「では、ゴブリン村へ案内します」
「ああ」

　小麦袋を一人一袋ずつ背負い袋に入れて持っていく。
　二人が森に入り、ルフガルへと戻ってくる。

「立派なもんだ」
「入口の改修は最近して」
「そうか。ゴブリンにしては文明的だな」
「ドルはゴブリンなのに聡明なので」
「なるほど」

「みんな、戻ったわ」

　ゴブリンたちがわらわら中から出てくる。

「けっこういるな、おい」

　ゴブリンが笑顔で迎えてくれる。
　口元の牙がキラリと光った。


「長のベダだべ」
「ベダの妻、ベリア」
「どうもどうも、よろしくお願いします」
「人間の会話、まどろっこしい」
「あはい、簡潔にしますね」
「頼む」

　ゴブリンは人間語をしゃべるが、会話がそこまで得意ではない。
　なんというかちゃんと話せるゴブリンがいないのでみんな片言なのだ。
　まぁ俺は元貴族なので、やんごとない表現も知っているが、みんなは違う。

「ナイフだ、ナイフ」
「お、いいな」

　俺も新品のナイフを見て、にやりと笑う。
　ボロい相当古いナイフをだましだまし使っていたが、改善されそうだ。
　今までは困ったときはリーリアのナイフが一番まともだったので、それに助けられていた。

　本当は一人に一本ナイフくらいは欲しい。
　とりあえずは狩りのパーティーに一本ずつというところか。

「弓矢のセットが欲しいんだが、十セットくらい」
「いいが、町まで買い付けに行く。ちょっと時間かかるぞ」
「かまわない」
「金は？」
「前ので足りる」
「そうか」

「短槍も十本くらい欲しいんだが」
「いいが、そんなに持ち運べない。次の次くらいでいいか？」
「いい」

　今までに比べたら、これくらいの待ち時間たいしたことではない。
　それより木槍を卒業だと思うと、とてもうれしい。

「魔石はまだあるか？　それから塩は？」
「ある、こっちだ」

　奥の方の倉庫に保管されている。
　この倉庫部屋にはいろいろなものが雑多に置かれていた。

「塩もかなりあるな」
「みんなで採りに行く。人数少ないと危ない」
「なるほど」

　一キロくらいの岩塩が十個以上置いてある。
　これならかなり持つだろう。

「塩を三個くれ」
「いいぞ」

　それから隣の魔石コーナーを見ている。

「すごい数だな」
「ああ、使い道なかった」

　今でこそ魔道具にしているが、今まで使っていなかった。
　ただゴブリンはこういう収集癖があるので取っておいたのだ。

「ほとんどがウサギだな」
「ああ」

　ウサギの魔石については千個以上。
　オオカミの魔石が百個くらい。
　それから、ゴブリンの魔石が同じく百個程度だろうか。
　この洞窟の歴史を感じさせる。

「ゴブリンのもあるのか」
「死んだゴブリン、魔石取る」
「そうか」

　葬式で魔石を回収する儀式がある。
　ゴブリンの魔石はオオカミのよりも少し大きいだろうか。

「この大きいのは？」
「それはオーク。弱っていたので仕留めた」
「そうか、そうか、そりゃすごい」

　手負いのオークが昔おり、倒したのだという。
　ここにその魔石が保管されていた。

「こんだけあれば当分遊んで暮らせるだろうが」
「全部は売らない」
「そうだな。貯金も必要だし、魔道具にも使うんだろう」
「んだんだ」

　この日、ゴブリンたちは商人ガルドにオオカミ肉を振る舞い、宴をした。
　宴といってもいつもと大して変わらないが、気分の問題なのだろう。
　ゴブリンの適当な踊り、適当な歌で火を囲う。

■第7話　宝石探し

　オオカミからほとんど逃げていた頃にくらべて、オオカミも倒せるようになり狩り時間が大幅に減った。
　余った時間を有効活用したい。
　今は時間を持て余しており、オスゴブリンは昼寝までしている。
　メスたちは以前と同じように草を編んでいるが、これも輸入の綿の服を買うことになり、仕事がない。
　後は食事の支度くらいだが、リーリアが張り切っており、調味料を使ったゴブリンよりは凝った料理を作るようになった。

「うまうま」
「おいち」
「飯、旨くなった」

　鍋を購入したので、オオカミの骨の出汁に野草と塩胡椒で味をつけたスープも作るようになった。
　元人間である俺もお気に入りのスープだ。

　小麦粉も水と練って無発酵パンを作っている。
　このパンは固くて食べづらいが、少し保存が効くので、夕方に焼いて数日間のうちに食べるようにしている。

　おかげで雨の日まで無理して狩りをしなくなった。
　そういう日はジャーキーとパンとスープで済ます。

「川、綺麗な石、落ちてる」

　誰が言い出したか不明なのだけど、綺麗な石があるという。
　確かに見せてもらうと宝石の一種のようだった。
　青い鮮やかな石だった。

「赤いのもあった」
「ふむ、そうか」

　暇になった俺たちはメルセ川に行き、河原を見る。
　確かに小さないろいろな種類の石がたくさんある。
　この中に宝石があるらしい。
　上から眺めるがよく分からない。
　大きな皿に小石をすくい、ちょっとずつ捨てていき、選別していく。

「ん、これか」

　それは綺麗な緑色の翡翠だった。
　ここの辺りには様々な鉱石が混ざっているようで、宝石でなくても結構カラフルだ。

　みんなで夢中になって石を拾う。
　普通のゴブリンなら、あまり生産性のある行動でないが、俺たちは交易によって金にして様々なものを買えるのだ。

「あーあー、グレアもやりたい」
「んーん、まぁいいか」
「やった、グレア宝石探す」

　グレアがガッツポーズをして踊りだす。
　まったく好奇心旺盛なんだから。

　グレアを連れてメルセ川で宝石を探す。
　最初はちまちま一個ずつ捨てていたが、だんだん慣れてきたのか、次々とポイポイと選別していく。
　子どもは適応力が高いのか直ぐ上達するな。大人も目を見張る。

「あった」

　小さな赤い半透明の石だった。おそらルビーだろうか。

「きれい！　ぱぱ、きれい！」
「おう、よくやった！」
「きゃっきゃ、ほめられたあ！」


　さていいことばかりは続かない。

「ガルたち帰ってこない」
「ああ、心配だ」
「もうご飯になる」
「だよな」

　狩りに出かけたパーティーのうち、ガルのパーティーが帰ってこないのだ。
　メンバーはオス五人。

　ゴブリンは律儀に待っていたりはしない。
　残りのメンバーで食事をする。
　暗い雰囲気の中、違うパーティーが狩ってきたウサギ肉を食べる。
　オオカミを食べることも多くなったが、もちろんウサギ狩りもしている。

　夕方、西日がオレンジに染まるのを合図に戻ってくるはずなのだ。
　何かに夢中になっているということはさすがにないだろう。

　結局その日は、夜みんな待っていたのだが戻ってこなかった。

　それから数日して。
　俺たちが狩りに出かけて森を歩いていたところ、荒れた場所があった。
　そこに火魔法の棒が折れたものが落ちていたのだ。

「これ、火魔法の棒」
「だな」
「ガルたちだ」

　周辺には他にもゴブリンの所有物だった槍の一部、服が引き裂かれたモノなどが散乱している。

「オオカミに食われた跡だ」
「誰にやられたかは不明だが、食ったのはオオカミだろうな」

　オオカミには勝てる。
　しかし群れだった場合は五分五分だ。
　オークに倒されて、残った死体をオオカミが食べた可能性もあった。

「無念」
「ああ」

　狩りはそのまま続ける。
　夕方、ルフガルに戻り、状況を説明した。

「ガル……」

　ガルの奥さん、ベリアが泣き崩れている。
　ゴブリンにも恋愛感情とかあるらしい。
　俺はあまりゴブリンに関心がないが、愛情くらいはある。
　犠牲者の中にはまだ若い、奥さんがいない独り身のゴブリンも二人いたはずだ。
　まともな死体もなかったので、痕跡だけの報告となった。

　ゴブリンは病気などには強いが、物理的防御力が低い。
　背が低く手足が細いので、こればかりは仕方がない。
　人間よりよっぽどひ弱だ。

　今回の事件はこれを見せつけられた。

　この日の夜ご飯は、弔いの宴になったが、酒は持っていないので出ない。
　食事内容もいつもと違わない。
　歓迎の宴のように、火を囲んで歌いながら踊るのが習わしとなっていた。

　グレアはそれを不思議そうな顔をして見ていた。
　遊んでもらっていたガルたちがいないことは理解しているのだろう。
　ただ死ということがどういうことかはまだグレアには早いかもしれない。
　きょとんとした顔で変な踊りをじっと見つめていた。

■第8話　秋の味覚

　そろそろ秋も深まってくる。
　この秋が過ぎれば寒い冬だ。
　もっとも凍るほどではないので助かる。

「よし、いくぞ」
「おおお」

　オスのうち俺たちのパーティーは狩りをせず、背負い袋を再確認して森に入る。

「あった、ドングリだ」

　みんなでドングリを拾う。
　椎の木なのだろうか、その周りには無数のドングリが落ちている。
　それを一個ずつ拾っては背負い袋に入れていく。
　地味な作業だ。
　ゴブリン。背が低い以外にも手が長いという特徴がある。
　少しかがむと手が地面に届くので、モノを拾って歩くのに向いている。
　人間だったら腰を痛めそうだ。

「ぱぱ、ぱぱあ、ドングリ！」
「おう、いっぱい拾おう」
「うん！」

　グレアはもう五か月くらいか。
　足腰も丈夫になり、小さな体ながらすでに戦力の一部だ。
　もちろん女の子なので狩りにはいかないが、こうしてドングリ拾いには参加している。

「ママっ」
「はーい、遠くへ行っちゃだめだよ」
「分かってるよ」

　本日はママ、リーリア付きだ。
　リーリアが外の仕事についてくることは珍しい。
　もっとも人間なので、暗い洞窟の中でばかりいられない。
　たまに陽に当たったりはしているようだ。

　夜目が利かないリーリアのために、俺は光の魔道具も作った。
　だいぶ前の話だ。
　それで俺たちの部屋は昼間も夜も明かりがついている。
　リーリアにも感謝された。
　魔石は有り余ってるので、コストはほとんどかからないのだ。

　ドングリ拾いを終えた帰り道。

「見ろ、バクラ、ある」
「おう、いいサイズだ」

　バクラとはキノコの一種だ。
　倒木や朽ち木に生える。
　焼いて食べるととても美味しい。
　茶色くて少し大きくなる。シイタケの大きいのくらいだろうか。

「よし、持って帰ろう」

　キノコだけではない。
　木ごと持ち上げて持っていく。
　このキノコ、木陰などを好むため、暗い洞窟の中で育てると大きくて美味しいものがいっぱい生える。
　ひとつの朽ち木でひと月ほど生え続けるので、丸ごと持って帰る。

「ナニコレ、美味しいの、パパ？」
「ああ、めっちゃ美味い」
「やったぁ！」

　きゃっきゃとグレアがよろこんで走り回る。
　ゴブリンの子どもも無駄に体力があって、よく走る。
　人間の子どもと一緒だ。
　体が軽いから身軽なのだろう。

　こうしてルフガルの洞窟に戻ってきた。

「ドングリ♪　バクラ♪　ドングリ♪　バクラ♪」

　適当な節をつけてグレアが歌う。
　みんなはそれを見てニコニコしている。
　美味い飯が食えるのだから、みんな機嫌がいい。

　ドングリは平らな石があり、すりつぶして粉にする。
　それを固めて焼くのだけど、今年は小麦を少し入れてしっかり固まるように改良した。
　以前のはドングリだけだったのでけっこうボロボロとこぼれやすかった。

　他のパーティーがとってきたオオカミ肉も食卓に上る。
　ドングリクッキーに焼きキノコ、骨のスープ。無発酵パン。オオカミ肉。

「うまうま」
「うんうん、美味しいね」

　秋は食べ物が多くて助かる。
　いっぽう反動なのか、冬が問題だが今年は小麦もあるし、ジャーキーも十分あった。
　ジャーキーはいくらか売ってしまったが、在庫は増えている。


　さて五人が行方不明になったことを受けて少し防御体制を見直す。
　今は単に土を盛っただけの土塁になっている。

「土に水を混ぜて日干しレンガにしよう」

　草と土と水を混ぜたものを天日で乾かして何個も作っていく。
　それを土塁の段差の部分に縦に積んでいく。

「どんどんレンガを作るんべ」

　ゴブリンたちもいつになくやる気だ。
　そうしてレンガの壁が出来上がった。
　レンガと土塁の隙間は土で埋めてしまい一体化させる。

　これで外側は垂直な壁になっている。これならオークでも登るのは無理だろう。
　土塁の上にレンガをさらに載せていき、矢間胸壁を作る。
　よくあるお城の凹凸の部分だ。
　これでさらに高さを出して、弓兵側の防御力を上げるのだ。

「すごいな」
「ああ、ドル、よくやった」
「俺たちゴブリンの仕事じゃねえな」
「もはや大ゴブリン様だぜ」
「あははは」

　城壁の上には見張りを立てることにした。
　まだ狩りに参加していない、俺より後に生まれた新人だ。
　今、ルフガルの人口は五人減って、そして新しく十人ほど増えて二十五人ちょっとか。
　普段、弓の練習を散々させている。
　外のところにカカシを立ててターゲットにしている。
　矢は何回も使いまわしさせればいい。銃弾だったらこれっきりだけど、そういう意味では矢は便利だ。

■第9話　ジャガイモ畑

　ガルドからこの辺りではマイナーなジャガイモを購入した。
　まず近くのシャーリア村では扱っておらず、その向こうにあるデデム町にもなかったため、取り寄せをすることになり一か月ぐらい掛かった。
　俺たちは魔石がたくさんあるのでお金は思った以上に裕福だ。
　それで馬車一個分、まるごと買い付けることを条件に入手に成功したのだ。

「で、これがジャガイモです」
「おお、よく持ってきてくれた」
「これで全部じゃないので、毎週、持ってきます」
「おう、そうしてくれ」

　俺は冬支度を始めたのだ。
　小麦粉があるので主食はなんとかなるが、ビタミンなどは不足しがちだった。
　そこで目を付けたのがジャガイモだ。

　細切りにして炒めたり、鍋で蒸かすだけでもいい。
　そしてなんといっても、この土地でも栽培できそうなのが最高だった。

「みんなでジャガイモを植えるぞ」
「おおおおお」

　ということでさっそくジャガイモを四分の一に切って、城壁の外を耕して、そこへ植えていく。
　すぐ先は森だけど、洞窟の入口の周りは俺たちが歩くため、草地が広がっているのだ。
　ナイフを先端に縛った木の棒や槍を使って土を耕した。
　ナイフもさらに追加で購入して、何人かに一人は持っている。

「ジャガイモ～♪　ジャガイモ～♪　ジャガイモ～♪」

　新しいものが大好きなグレアが、適当な節をつけて歌う。
　それを大人が真似してみんなで歌いながら畑仕事になった。

　こうして俺たちは狩猟採集生活から半分は農耕生活へと進化を果たしたのだった。


　さて、この森の崖には俺たち以外にもゴブリン一家が何軒か住んでいる。
　それから他にも洞窟はあり、そこにはシルクスパイダーという大型のクモ型モンスターが生息していた。

「ということでシルクスパイダーと仲良くなりに行きます」
「おおおおお」

　俺たちのパーティー五人が目星をつけてあった洞窟へと移動する。

「敵だと思われたら、俺たちが不利だから気を付けてね」
「お、おう」
「怖い」
「まあ、大丈夫、大丈夫」

　貴族だったころにシルクスパイダーのことは文献で読んだことがある。
　約二メートルの巨体なので、ゴブリンや人間すら食べるという噂があるが、実際にはそういうことは敵対しない限りは大丈夫らしい。
　村ぐるみで飼ってスパイダーシルクを貰って特産品にしているところがあるのだと書かれていた。
　あれからどうやら五十年ほど経過しているようだが、今も同じだろう。

　洞窟は俺たちのルフガルよりかなり小さい。
　入口も狭く、人が一人通れる程度だ。

「ごめんください」

　もちろんシルクスパイダーは言葉を理解したりはしない。
　一本道の洞窟の奥まで行くと、そこには巨大な黒いクモが巣を張っていた。

「オオカミ肉をお持ちしました。どうぞ」

　肉を前に差し出す。
　すると巣からクモが降りてきて、肉をぐるぐる巻きにして持っていく。
　ものの数分でオオカミ肉はミイラのようになってしまった。

　似たようなミイラの古いものをクモが足で器用に運び、こちらへ落としてきた。

「えっと、これを貰っていいってことですか？」
「……」

　クモは応えてくれないが、たぶんそう言うことだろう。

「ありがとうございます」

　お礼を言って、洞窟を出る。
　手元には中身が食べられて空洞になったスパイダーシルクの塊が残された。

「これだけあれば、かなりの金額になるな」
「ゴブゴブ！」

　スパイダーシルクはシルクの王様だ。
　最高級の糸であり、これでドレスを作れば一財産であった。
　前世の子爵家でも結婚式のときに一着作ったことがあるだけだ。

　ゴブリンは陽気なので、みんなで踊りながらルフガルに戻る。
　このぐるぐる巻きをメスに渡す。
　あとはリーリアたちの仕事だった。

　木の棒に、探り当てたスパイダーシルクの先端からぐるぐると巻いていく。
　糸巻の作業だ。

「きゃっきゃ」

　白い光沢のある糸が巻き取られていく。
　グレアも最初は興味深そうに見ていたが、だんだん飽きて今は周りで遊んでいる。
　スパイダーシルクの糸は本当に長く、どんどんと巻き取られていくが、終わりが見えない。
　こうして巨大な糸巻がいくつもできあがっていく。

　後日。ガルドが来訪したときにスパイダーシルクの糸巻を見せる。

「ふむ。とてもいい品に見えますね」
「だろ、スパイダーシルクだもん」
「そうですか。ちょっと値段が分からないので、後払いでもいいですか。町で売ってみます」
「後払いでいいから、頼んだよ」
「任された」

　というふうな会話あって、ガルドの持ち帰りとなった。
　結果は次来る時となった。

■第10話　オオカミ犬

　ガルドの村までの往復には二日掛かる。
　おそらく更にデデム町まで行ってくれているはずだ。
　ということで更に数日は掛かるのだろう。
　村では買い取りとかしてくれる店もない。
　小さな雑貨屋はあるみたいだけど、値段の分からないものの買い取りはしてないと言っていた。

　一週間ほど経過した。

「おーい」

　ガルドが帰ってきた。
　笑顔なので商談は上手くいったようだ。
　今回も残りのジャカイモを背負ってきている。

「スパイダーシルクどうだった？」
「かなりの高値をつけてもらった。王都まで運べば更に高いそうだが、構わないだろ？」
「ああ、自力で運ぶほど暇じゃないな」
「ほら、金貨」
「確かに」

　俺は金貨を受け取ってにんまりと笑う。
　金貨がかなりの枚数だ。
　これなら相当な儲けになる。

「何を買うかなぁ」
「そうですね」
「そうだ、オオカミ犬が欲しい」
「オオカミ犬ですか」

　ゴブリンは人間と同じで鼻が利かない。
　犬がいれば狩猟犬にできる。

「シカ狩りがしたい」
「なるほど」

　ウサギはその辺にいる。
　オオカミは襲ってくるのを返り討ちにしている。
　オークは逃げるに限る。
　あとはイノシシはそうだな。火魔法の棒があればなんとか倒せそうだろうか。犠牲が出るかもしれないが。
　サルもいるが頭上の木の上を移動するので手が出ない。しかも群れる。

　それでシカだ。こちらの音を聞いてさっさと逃げていくので狩るのが難しいのだ。
　だから普段、糞が落ちてることはあっても姿を見せることはない。
　そこで犬で追い立てて、目の前まで連れてくることを考えた。

　結構な数のオオカミを狩ったので、こちらは数が減ってきている。森の奥から移動してくるのでそこまでの影響はまだない。
　それでもリスクの分散はしたい。
　それにオオカミが減ってシカが増えるとなるとシカによる食害も心配だ。

「ワンコか、分かった」

　ガルドが請け負ってくれる。

　それから更に一週間後。

「ワンコだぞ」
「ワンワン！」
「ワウウ、ワオオウン」

　まだ若いちょっと大きい子犬だった。
　全部で六匹。
　オスメス、それから複数の親の子で全員が兄弟ではないそうだ。
　繁殖させるならそのほうがいいな、助かる。
　授乳期は終えており、もう肉を食べる。

「パパ、ワンコ？」
「うん。犬だよ、犬」
「分かった！　ワンコ、ワンコ」

　グレアが犬に突撃していき、みんなで揉みくちゃになっている。
　仲良くできそうでよかった。

　それから、数日。

「シカ、捕れた」
「でかした！」

　犬を三匹連れた違うパーティーが念願のシカを仕留めた。
　この森には今までゴブリンに捕まることもないため、かなりの数のシカが生息している。
　資源は有効活用したい。

　シカ肉を早速、夕ご飯に食べる。
　ただ焼いただけだが、かなり美味い。
　スープにもいくらか入れてあり、旨味が出ている。

「おいち！」
「うまうま」
「ああ、うまいな」

　グレアもにっこりだ。
　ちなみにグレアはドングリのころにおっぱい以外も食べるようになり、最近、グルメに凝っている。
　これには料理をしてくれるママ、リーリアを見ているのも関係あるのだろう。

　料理関連も、フライパン、オリーブオイル、専用のナイフ、お玉、などなどを仕入れている。
　葉っぱはその辺で採ってくるのがあるのでそれ以外として食材も、トマト、ナス、トウモロコシ、ダイコン、ニンジン、タマネギなどを少量ではあるが買い付けた。
　スープに入れたりして味のアクセントに使っている。

「おいち！」
「グレアもすっかりグルメちゃんだ」
「パパ。ママ、料理上手」
「だなぁ、いいママでよかったな」
「よかったぁ！」

　ニコニコしてご飯を食べる。


　そんなある日。

　俺たちのパーティーが非番で洞窟で休んでいた。三パーティーあるのだが、今はいちパーティーは休みにしている。

「大変だ、イノシシだ、イノシシ」

　ゴブリンが森の中から飛び出して、洞窟に逃げ帰ってきた。

「グググルルウ」

　どこからかイノシシの声が聞こえる。
　ドシドシと地面をイノシシが駆ける音がここまで聞こえてくる。
　洞窟の監視をしている若いゴブリンたちが一斉に弓を構えた。
　城壁の上からイノシシが出てくるのを待つ。

「はぁはぁはぁ、イノシシ……」

　先に飛び出してきたのは逃げてくるゴブリンだった。
　急いで城壁の中へと入ってくる。
　そのすぐあとに森からイノシシが姿を現した。

「グルグルグルルル」
「かなりデカい」
「大物だ、みんな掛かれ」

　弓が一斉に引かれる。
　人間製の弓矢は精巧にできていて、命中率も高い。
　先端には鉄の鏃もついており攻撃力も高かった。

「ブヒイイイイ」

　何本か矢が命中したイノシシは怒りの咆哮を上げる。
　俺たちはそれを見つつ、短槍を装備して応援に駆けつける。
　短槍も人間製で購入したものだ。
　以前に使っていた木槍は先端を尖らせたただの枝だった。
　この短槍は柄こそ木製だが丈夫な木が使われている。そして先端は矢同様鉄製なので、かなり丈夫でやはり攻撃力も高い。

「槍部隊！　突撃！」
「おおおお」
「いけえええ」
「うわあああ」

　俺が掛け声を上げて、みんながついてくる。
　矢により興奮しきったイノシシを一方方向から一斉に攻撃する。
　次々と槍が刺さり、イノシシが再び咆哮を上げるが、致命傷だったようで、ドスンと倒れてピクピクしていた。

「倒したぞおおおお！」

　残りの左右の槍兵もイノシシに攻撃を加えたが、もう動かなくなっていた。

「イノシシを仕留めた！」
「俺たち、ゴブリンがやったんだ！」
「うおおおおお」
「勝った！　勝った！」

　恒例の意味不明なゴブリンダンスがはじまる。
　次々と洞窟からゴブリンが出てきてこれに加わった。
　最後尾にはグレアまで見様見真似で一緒に踊っている。かわいらしい。

■第11話　長

　イノシシは解体され、みんなの食料とされた。
　残りはジャーキーにされる。
　今夜はイノシシ肉の焼いたものが出る予定だ。

　あれからしばらく、解体がその場で行われつつ、踊りが続いていた。
　運ばれていくイノシシ肉の塊はすごい迫力がある。

　それからイノシシの魔石。
　動物も例外なく魔石がある。
　というか人間にも魔石はある。

　人間もゴブリンもみんな広義では魔物なのだ、この世界では。
　だから「モンスター」というくくりは人間の都合で決められているに過ぎない。
　そういう意味でゴブリンをモンスターに含めるかは、場合による。
　人間の中には、ゴブリンを家畜に含めようという意見もある。

　教会は「人間はモンスターではなく、選ばれた種族である」としているが、俺たちゴブリンからしたら噴飯物だろう。
　教会では人間から魔石を採取することを禁止しており、そもそも人間から魔石が採れることを隠している。
　だから一部の人しか知らないのだ、人間もモンスターだと。

　イノシシは牙もかなり立派だ。
　それから皮も人間に売れるだろうから大事に剥ぐ。

　こうしてしばらくイノシシ料理が続くことになる。
　イノシシ肉も少し臭いがあるものの、オオカミ肉ほど癖がなく食べやすい。
　この個体はメスだったようだ。
　オスのイノシシはもう少し臭いという噂だ。



　イノシシで盛り上がって一週間くらいしたある日。
　長であるベダがどうも調子が悪いらしく、寝込んでいる。

「俺はもうダメだ。長はドルに継がせる」
「あなた」
「ゴホゴホ……」

　いきなりそう言う話になった。
　ベダの子どもは何人もいたのだが、他の子たちはオオカミに襲われたり、この前のガルのパーティーが全滅したときに、上の兄二人も失った。
　一人はメスなので長には通常ならない。

　今までも俺は長の息子として、あれをしよう、これをしようと意見を言ってはいた。
　ただ本当に長になるつもりはなかったので、びっくりしたのだ。
　俺より経験豊富な年長のオスのゴブリンもたくさんいる。他にも適任者はいそうなものだが。

「ドルは賢い。これからは頭の時代だ」
「長、ベダ……」

　そこからはあっという間だった。
　四日ほど寝込んでいたが、ほとんど食事もせず、そっと息を引き取った。

　恒例に従い死亡したゴブリンは、心臓近くにある魔石を取り出す。
　この魔石は奥の倉庫で保管される。
　ベダの魔石はゴブリンの中でも一番大きいサイズであった。
　さぞかし強いゴブリンだったのだろう。
　ゲームでいうところのレベルが高いというやつだ。
　この世界にはゲームのようにステータスは表示されないが、冒険者ランクのような制度はある。

　洞窟の外で穴を掘り、木の枝で囲い、そっと遺体をそこに置いて、火をつける。

「ベダが安らかに眠れますように」
「ベダ」
「おじいちゃん……」

　グレアから見たらおじいちゃんに当たる。
　今回は遺体が残っていることから、死というものがどういうことなのか、グレアにも分かるようだった。
　火をつけて見守っているとき、珍しく涙を流してワンワン泣いていた。
　それをみんなは静かに見守る。

　ゴブリンである以上、人同様、生まれてくることもあれば、死ぬこともある。

　こうして俺は長を継ぐことになった。

「まずは防御力を高める」
「鎧ですね」
「そうだ」

　ガルドと商品の打ち合わせをする。
　短槍の数を増やし、さらに戦士の人数分に加えて予備も合わせて鎧を購入する。
　初心者冒険者が使うような安い革鎧だ。
　しかし牙や木槍くらいであれば、十分な防御力を有する。
　今までは草の服だったからな。

　しかもゴブリン用は小さいので子供用と一緒でそのぶんお安いのだそうだ。
　ありがたい。

　ガルドに大量に発注して持ってきてもらう。
　今回はなるべく早く欲しいので、リーリアを付けた。
　リーリアもたまには村に戻って神父に会ったり、何か欲しい物を探したり、息抜きくらいしたいだろう。

「ママ、いない……」
「ママは出張中だよ。すぐ戻ってくる」
「ママ、ママ」

　グレアはしきりにママがいないことを気にしていた。
　どうもベダが死んでから、いないなら死んでしまったのではないかと考えているのかもしれない。
　なんとかみんなでなだめている。


「戻ってきたわよ」

　今回は思ったより早かった。

「あっ、まま」
「グレア、いい子にしてた？」
「うんっ」

　毎日、洞窟の入口で外を眺めてリーリアを待っていたグレアが飛び出していく。
　話を聞くと、どうも以前に、さらに武器防具を欲しいと言ってあったのがよかったらしく、先に注文はしてくれていたそうだ。
　それで村の往復だけで済んだ。

「おりゃああ」
「うりゃああ」
「ゴブゴブ」
「グギャギャ」

　しばらくゴブリンたちが戦闘訓練をする声が洞窟周辺で聞こえた。
　攻撃力も防御力も上げた。
　火魔法の棒も増やしてある。
　弓矢の訓練も交代でさせている。

　こんなに強くしてどうする気だと思うかもしれない。考えがあるのだ。
　そのためには強ければ強いほどいい。
　それに加えオークの脅威もある。
　もちろんワイバーンやドラゴンなども世界を見渡せばいるが、それは例外だろう。不運だと思うほかない。
　ガルたちが誰に殺されたか分からないが、ゴブリン五人をあっけなく殺せる相手がどこかにいることは事実なのだった。

■第12話　制圧

　訓練を重ねたルフガルのゴブリンたち。

「いよいよだ」
「はい、長」
「それでは出発する」
「はい」
「ゴブゴブ」

　指揮を執るのは俺、ドルだ。
　ゴブリンが全部で十五名。
　槍部隊、火魔法の棒の魔法部隊、弓兵部隊に分かれている。
　火魔法の棒は予備も持たせてあった。
　それからリーリアとグレアだ。この二人は「ヒール」と「祝福」が使えるのだ。
　万が一戦闘になったときには、生存率にかかわる。
　リーリアは魔法部隊と弓兵部隊のリーダーである副隊長もしてもらうことになった。
　戦闘経験はそれほどないが普通のゴブリンより冷静だし頭がいい。

　それでどこで何をするかというと、北のゴブリンの集落を襲う。
　襲うといっても、実際に攻撃するわけではない。
　北の村の規模はすでに偵察してあって、十五人程度の家族だと分かっている。

　どう考えてもこちらのほうが強い。
　向こうは藁の服に木槍だ。以前の俺たちと同じような装備だと考えていい。

　全力で「脅して」傘下に入ってもらう。
　同規模の戦力なら戦闘になるが、ゴブリンがいくらバカでも絶対に負けるのが分かっているくらいなら、さっさと降伏するはずだ。
　ゴブリンは肉体的には弱いので、すぐ逃げるし、臆病でもある。

　その間、ルフガル洞窟のほうが危険ではあるが、今回の作戦は賭けでもあった。

　謎の脅威に立ち向かいたい。
　それはオークの可能性が高い。俺たちだけでは勝てそうにないのだ。
　一気に戦力を増やすには、他のゴブリン一家を傘下に引き入れ、数で攻める。
　もちろん俺たち同様まで武器や防具のアップデートはする。

　適当な列になって、目的の北の洞窟へ向かう。
　こういうときに綺麗に列にならないのがゴブリンらしい。
　ここ以外にもいくつか洞窟があり、何家族か住んでいることが分かっている。

　文明シミュレーションゲームとかでも初期に平和な村で遊んでいたら、いきなり民兵の軍隊に襲われて壊滅するなんてことがある。
　あれの襲う側だ、今回は。
　場合によっては自分が襲われる側だった場合もあるのだ。
　気を引き締めたい。

「たのもー」

　洞窟の前に到着すると声を上げる。

「ゴブゴブ」
「なんだ、なんだべ！」

　中から何匹ものゴブリンが出てくる。
　今は昼間なので、半分程度は狩りに出ているのだろう。

「俺たちは南側のゴブリン、ルフガル洞窟のものだ」
「あぁ、南側の……」

　何人かのゴブリンはやはり木槍で武装しており、それを空に向けて突き出し威嚇してくる。

「見ればわかるように、俺たちのほうが強い」
「ぐぬぬ」
「負けを認めて、俺たちの傘下に入らないか？」
「な、なんだと」
「別に取って食おうってわけじゃない。みんなで平和に暮らしたいだけだ」
「ふむ」
「支配はさせてもらう。今よりいい生活ができるぞ」
「な、なんだと」
「ほら、餞別のジャーキーだ。食うか？」
「ゴブゴブ」

　しかし俺たちの服装が明らかに人間レベルであるのを見れば、納得したように頷いた。

「わ、分かった」

　向こうの長が前に出てくる。
　だいぶ歳だ。深いシワがある。

「北の洞窟の長、グバ」
「南の洞窟の長ベダの息子。今度、新しく長になった。ドルだ」

　俺たちが握手をする。
　すると後ろで、なんだかんだで歓声が上がる。

　とまあ緊張していたが、なんとかなった。
　ふう、バカなゴブリンでも、本当にバカ丸出しではなくてよかった。
　戦力差を無視して攻撃してくる可能性もあっただけに、心配していたのだ。
　戦闘になれば双方に被害が出る。
　戦力の低下はすぐに、さらなる脅威への抵抗力低下に直結するため大問題だった。

　北の洞窟はバッダグというらしい。
　翌日、さっそく槍と防具の予備を持っていく。

「ほい、槍と防具」
「い、いいのか？」
「ああ、説明したが俺たちより強い敵がいるんだ。協力したい」
「わかった。助かる」

　まだ戦士全員分ではないが、これで戦力増加にはつながる。

「それから、移住者を募りたい」
「移住？」
「住民の交換をしよう。血が濃くなるとよくない」
「そうなのか」
「ああ」

　ゴブリンは家族単位なので、かなり血が濃くなりやすい。
　四、五人入れ替えをすることになった。

　出奔して別の家族のゴブリンのところへ行く放浪ゴブリンもごく稀にいる。
　家族の人数が増えれば、違う洞窟へ分家することはあるが、元は同じ家なので血の濃さはそのままだ。


　ルフガル、バッダグ合同の訓練もかねて、今日はあるものを採りに来ていた。

「よし、やれ！」
「うわああああ」
「ぎゃああ」
「グルグル」
「ゴブゴブ」
「グアッ」

　ゴブリンたちが慌てふためいて逃げ惑う。
　何をしているかというと、ハチの巣を採りに来たのだ。
　今は秋を過ぎた頃、冬越しのためにたっぷりの蜂蜜がある。
　ゴブリンは甘いものも大好きだ。

　煙を焚いてハチを弱らせながら、巣から蜂蜜を回収する。
　違う家族といっても、人間語が話せるので意思の疎通はできる。
　ハチに刺されたりしつつ、なんとか甘い蜜が採れた。

　二家族で分け合って、それぞれ持ち帰った。

「パパ、甘い！」
「ああ、これが蜂蜜だ」
「蜂蜜、ちゅき！」

　グレアは今回お留守番だったので、不機嫌だった。
　でもちゃんと蜂蜜を持って帰って食べたら、ご覧の通り、みごとに機嫌が直った。
　やっぱりゴブリンは甘いものが好きなようだ。

■第13話　岩塩

　ガルドが手持ちに余裕があるときは、毎回塩を買っていっていた。
　それから北の洞窟のゴブリンも同じように塩は使っているようだった。
　北の洞窟の岩塩も少し分けたのだが、塩の在庫がそろそろ乏しい。


「みんな、今日は岩塩を採りに行く」
「ゴブゴブ」
「はいぃ」
「グレアも行っていいの？」
「ああ、もちろん」
「やった！」

　大勢、この前の戦士、十五名ほどがルフガルを出て途中で北のバッダグ洞窟に寄っていく。

「俺たちは塩を採りに行くが一緒に行くか？」
「グフグフ」
「それはいい、行きますべ」

　とまあ話がすぐついて、バッダグ洞窟の連中も連れていく。
　エルへレス森の中を進んでいき、北のベレリスト山に到着した。

「ギャアアアア」
「んだんだぁ、ワイバーンの咆哮だ」
「うわああ」
「もう終わりだぁああ」
「まぁまぁ、ファイア」

　俺たちが武装の火魔法の棒を何本か空中に向かって攻撃すると、さすがのワイバーンも逃げていった。

「ふぅ、助かっただべ」
「怖かぁ」
「もう、おっちんじまうかと」

　まあ何とかなった。
　森林内はまだいい。
　とまあこんな感じに岩塩の採掘場へ向かう山道は命がけなのだ。
　木が途絶えて、地面が露出しているところを歩いていくので、空から見たら丸わかりなので、こうしてワイバーンが遊びに来る。
　あいつらも暇なのかもしれない。
　上位捕食者はお腹いっぱいにイノシシとか獲って食ってるのだろう。

「よし、到着。今回は犠牲者ゼロだ」
「やったな」
「やっと着いた」

　新品のナイフを使って岩を四角に削りだりしていく。
　定期的にやっているから慣れているが、前はボロボロのナイフだったので今回はだいぶやりやすい。
　背負えるように一キロぐらいの塊にしていく。

　不思議なもので上と下の層は茶色だが、この層の部分だけ分厚く白くキラキラしている。これ全部塩なのだ。

「よし。とれたべ」
「おおお」
「帰るべ。帰るべ」
「こんなおっかない所はさっさといくべ」
「んじゃ、帰りまーす」

　長である俺の合図で、山を下る。
　ワイバーンも上空で旋回しているようだが、さっきの火魔法の棒を警戒しているようで、近づいてはこない。
　やっぱり遠距離武器は持っているとこういうとき役に立つ。

　グレアは文句も言わず、見るものすべてが珍しいのか、キョロキョロしていたがワイバーンに岩塩、そして山の上から見える遠くまでの景色と勉強になるだろう。

「ほら、あの遠くにある壁、人間の町マーベルス町だ」
「マーベルス町」
「ここら一体を支配しているマーベルス侯爵の町だ」
「へぇ」

　グレアに人間社会、貴族などがいると言う話をすると、目を輝かせていた。

「え、もしかして長もエライんだら、貴族になれるかな？」
「ゴブリン村が人間の町村制度に参加することになるならそうだな」
「ふーん。そういう予定はないの？」
「今考え中」
「そっか」

　途中、バッダグ洞窟に寄ってからルフガル洞窟へと戻ってくる。

「塩を持って帰ってきたぞ」
「おおおおお」
「なんと犠牲者ゼロだ」
「やったあ、うおおおおお」

　塩も持ち帰ると、宴がはじまった。
　みんなで火を囲んで歌って踊り出す。いつものあれだ。
　まったくいつも飽きずによく踊るもんだ。

　それだけ岩塩の採掘は危険だと言う意味でもある。
　今まで、何回も犠牲を出してきた。対抗措置として人員を増やして大勢で作業するようにはしていたのだ。
　今回は装備も強化してやっとのことで被害ゼロという実績を残せたことになる。
　今までも運よく被害ゼロのことはあったものの、今回は運だけではない。今度からこれが当たり前になるはずなのだ。


　さていつもより多く塩を採ってきた。

「ガルド、塩いっぱいあるぞ」
「助かる。人間の町はたくさんあるからな、塩はいくらあっても足りない」
「そうか。犠牲もゼロにすることができるようになった。これからはちょくちょく採りに行く」
「そうして欲しい。頼んだ」
「ああ」

　塩の層は砂の非常に少ない綺麗な岩塩だ。
　本当はこれを一度、水に溶かして製塩をすると完璧なのだが、ゴブリンでは人出も足りない。

「まあ、岩塩のままでも十分だしな」
「製塩は面倒だからなぁ」
「そうなんだよ」

　そりゃ完璧な真っ白な塩なんて高級品だ。
　だが村人がそんないい塩が欲しいといっているわけでもないしな。
　領主くらいか？

「特注ということで領主向けに作ってみるか？」
「ああ、いいな」

■第14話　製塩

　ガルドとの話で少量だが製塩してみようという話になった。
　使うのは塩と鍋だ。

　鍋の数も今四個あって二つはバッダグに渡してあるので、手元にも二つある。
　昼間の空いている時間に作業する。

　昼飯はあまり食べないが、子どもたちにはジャーキーや未発酵パンを食べさせている。
　ゴブリンの子どもは大食漢ですくすく成長するのだ。

　岩塩を綺麗な湧水に溶かしていき限界まで入れる。
　それを一度、器に移していき、底に溜まった砂を捨てる。

「よし、いい感じだ」
「ぱぱ、製塩してる？」
「そそ。この前話したやつな。塩を作ってるんだ」

　塩水を沸騰させて、結晶化させれば、ほぼ完成となる。
　ポイントは一度、砂を捨てるところだろうか。
　それで最後に残った水分が「にがり」となる。

　岩塩があれば、どこでも誰でもできそうなものだが、知識がないとできないといえばそうかもしれない。
　それから鍋を煮るだけの火も必要だ。
　ここは森があるので、薪はいくらでもある。
　ゴブリンは枝を拾って来るのは、手が長くて無駄に上手だ。

「よしできた。後は革袋に移して終わりっと」

　綺麗な塩を革袋につめて完成だ。
　袋はオオカミをなめしたもので、革の服も余り気味になっている。
　ゴブリンは替えの服とかいう概念がないので、一巡したら余ってしまう。

「上出来だな」

　ガルドに岩塩と一緒に持たせる。

「ということで試作した製塩した塩だ」
「いいですね。売ってみましょう」

　一粒つまんで口に入れて、しょっぱいという顔をする。
　そりゃしょっぱいだろうが。


　シャーリア村の人は岩塩が豊富に使えるようになってニコニコだった。
　ガルドがデデム町の冒険者ギルドに商品を降ろす。

「岩塩、精製した食塩、ジャーキー、スパイダーシルク、宝石各種、牙のアクセサリーですかね」
「そうですね」

　ギルド嬢を見ると目が呆れている。

「こんなに商品を持ってくる人、あなただけですよ」
「でしょうね。ちょっと伝手がありまして。私はタダの行商にすぎません」
「はい、金貨です」
「まいど、どうも」
「ところでガルドさん。その……それだけの商品を出してくださる村の村長にお会いしたいと、マーベルス侯爵がおっしゃっていて」
「あぁ、いいのかな、わかった。連れてくる」

　侯爵クラスの貴族の「お願い」というのは事実上の命令に等しい。
　ただの冒険者の判断で拒否していいことではないことくらいガルドも承知していた。

「ただ、ここだけの秘密なのだが、彼らはゴブリンでして」
「野生のゴブリンなのか？」
「はい」
「ほほう。ますます興味深いですね」
「ゴブリンの長を連れてきますとお伝えください」
「ゴブリンねぇ」

　さてどうしたものかと考えながら、頼まれたものを買い込んだガルドがゴブリン村へと戻っていく。


　ルフガル洞窟にガルドが再び戻ってきた。
　そのころ、また新たに西のゴブリン村を同じように脅迫して同盟を結んでいた。
　まだ人員の入れ替えなどはしていないが、予備の鎧や槍などを提供して、ゴブリンが行きかっていた。
　それから他の村でもジャガイモ畑を作ることになり、いませっせと耕している。
　三つの洞窟の総人口は百人といったところだろうか。
　すでに小さな人間の村と同規模くらいにはなっていたのだ。

「ドル、厄介事だ」
「なんだ、ガルド？」
「マーベルス侯爵が、リーダーに会いたいとご要望だ」
「え、俺？」
「だろう」
「まあ、そう言われればそうだが」
「おとなしく、ついてきてもらうぞ」
「いっそ、ガルドの奴隷にでも擬態していようか」
「やめてくれ」
「いうと思った」

　さて冗談を交わしたので、今度は真面目な話をしなければならない。

「土産に製塩、宝石、それから魔石を出すか。オークの魔石がいいな。オークを倒せると言えば強さを証明できる。まぁ昔の実績で嘘くさいが、嘘は言っていない」
「あはは、まあそれくらいの見栄は張るよな」
「だろ」

　皮鎧を着て、手には単槍を左手には火魔法の棒を装備する。
　ゴブリンにしては重装備に見えるだろう。

　結局、土産にスパイダーシルクも増やしておく。
　シルクスパイダーにまた肉を差し出したところ、またおさがりのグルグル巻きをくれたので有難く使わせてもらう。

　宝石はあまりなかったので、総出でメルセ川へ探しにいく。
　一日の作業で数個、ルビー、サファイアなどが発見された。
　実を言うとどこかに金鉱脈もあるようで、砂金もちょいちょい採れる。

「よし、では行ってくる」
「いってらっしゃい～、ぱぱぁ」
「いい子にしてるんだぞ」
「はーい」

　グレアの頭を撫でて、機嫌をとっておく。

「リーリア、留守を頼む」
「はい」
「ばあちゃん、頼んだよ」
「あいよ」

　リーリアとベリアがいればまあ大丈夫だろう。

■第15話　人間の世界

　人間用のバッグにお土産の荷物を積んでルフガル洞窟をあとにする。

「んじゃ、ガルド、よろしく」
「はいよ。リーリアとは何回か来たが、ゴブリンを連れていくのははじめてだな」
「俺は常識があるから大丈夫だが、他のゴブリンの時は気を付けてやってくれ」
「分かった。その知識はいったいどこからくるんだか」
「あはは」

　転生知識ではある。秘密だった。
　前世から五十年ほど進んでいるようなのと、俺が住んでいるのはもう少し南部だった。
　地域的な差もあるだろう。

　半日と少し歩いてリーリアの出身地、シャーリア村に到着した。

「シャーリア村の俺んちに泊まれ」
「わかった」

　ベッドがあった。久しぶりだ。
　流石に悪いと思って、近くの小川で体を洗った。
　出るわ出るわ、汚い水。
　汚れが茶色い水になって流れていく。
　まあゴブリンだしな。
　メルセ川でたまに全身洗っていたのにこれなのだ。

　リーリアは洞窟の中でタオルのようなもので拭いていたけれど、他のゴブリンはそういうことはしていなかった。
　もちろんリーリアはグレアも同じように洗っている。

　ガルドの家でご飯を食べる。
　最近はリーリアのご飯も人間食に近かったので、それほどの感激はないものの、フォークとナイフだった。

「ドル。領主の館ではナイフとフォークだ」
「知っている。使えるぞ」
「え、そうなのか？」
「ああ」
「ならいい。練習していけ」
「助かる。ゴブリンになってから使ったことがない」
「だよなぁ」

　翌日、そうして街道を二人して歩いていく。
　歩くこと一日、デデム町へと夕方到着した。

　基本的に一日毎に村か町があるようになっている。
　そのほうが旅が便利だからだ。
　だから野宿することはほとんどない。
　ただ、ルートによっては近道とかいいつつ野営が必要になるようなケースもある。

「よう」
「こんばんは」
「本当にゴブリンを連れてきたな」
「首輪をしていないわ」

　受付嬢が俺を見て驚いている。
　普通は所有者を表す首輪をするのだ。
　脱走しても取れない丈夫な奴だ。

「どうも。ルフガル洞窟の長をしています。ベダの息子、ドルです」
「ふむ。デデム町冒険者ギルド長、ゲレンデです」
「ご丁寧にどうも」

　貴族よろしく、手をまげて挨拶してみる。
　ゴブリンの癖に生意気な、みたいになってしまった。

「礼儀作法も覚えているんですね。これはガルドが？」
「いや、俺は何も」
「へぇ、変わっていますね」

　さて冒険者ギルドで岩塩二キロを売ってしまう。
　残りはほとんど献上品だ。

「明日、馬車を用意しています。マーベルス町までご案内しますね」
「了解しました」
「本日はギルドの三階にお泊りください」

　冒険者ギルドには偉い人を泊めるための宿泊施設があるのだ。
　特に町が小さいと宿屋も小さなところしかないので、有難がられる。
　ギルドの一階の酒場で夕食の飲み食いをして、三階へ引っ込む。

　翌日の朝。

　ヒヒーン。
　馬車が回ってくる。
　俺とガルド、そしてゲレンデさんもついてくるらしい。
　三人で馬車に乗り込む。

「では出してください」
「出発します。マーベルス町までですね」
「そうです」

　最終確認をして、御者が馬に合図を送ると進みだす。
　懐かしい。馬車の感覚がよみがえってくる。
　馬車は快適とはいえないものの、荷物を背負って歩くよりはいい。

　景色が流れていくのを眺めながら、さてどうしたものかと考える。

「マーベルス侯爵でしたっけ、どんな人なんでしょう」

　以前貴族をしていたのは隣の国だったので、この国の貴族は詳しくない。
　主要な町の名前など地理は変わっていないようなので懐かしいものの、こちらも詳細までは知らなかった。

「そうですね。好奇心旺盛、利に|敏《さと》いお方でしょうか」
「ふむ」
「合理的に考えて、物事を判断するタイプでしょうか。まあ貴族らしいといえば貴族っぽい方ですね」
「なるほど」
「ゴブリンだからと言って悪いようにはしないでしょう」

　馬車で街道を進む。この街道は主要街道になっており整備が進んでいるためあまり揺れないのだそうだ。

　そうして夕方ぎりぎり、閉門間際にマーベルス町へと到着した。

「ぎりぎりでしたね」
「はい。これ以上速く走ると揺れるので……」

　つまり御者は閉門時間を考慮してなんとか揺れないようにしてくれていたのだ。
　なんというか貴族っぽい扱いになんともいえない。

　城壁の中は市場になっていて、人々が行きかっている。
　表通りの真ん中は馬車道専用で空いているが、人が横切っていくのが見える。

「けっこうな賑わいだ。いい街なのだろう」
「そうですね。ゴブリンでも分かります？」
「はい、一応」
「こりゃ失礼しました」
「なんなら百まで数えましょうか？　一、二、三、四」
「いえいえ、結構ですよ」

　ゲレンデさんにもゴブリンがどういったものか理解がまだ出来ていないのだろう。

「普通のゴブリンはこんな町を見たら目ん玉飛び出るほどびっくりしますね」
「あぁ、やっぱりそうなのですね。なんだか安心しました」
「あはは」

　冒険者ギルドへと話が通っていて、やはりこちらのギルドで宿泊することになった。
　さすがに地方都市だけあって、かなり豪華な部屋だった。

■第16話　マーベルス侯爵

　昨日の夕方、マーベルス町に到着して、使いを侯爵邸の領主館へと出してあった。
　なんでも今朝朝食後から会いたいとさっそく連絡があった。

　ここまで乗ってきた馬車に再び乗って、町の中心にある領主館まで向かう。
　通りは広く、また石畳が整備されていて綺麗に整えてある。
　かなりの財力があるようだった。
　俺の前世と比べてもかなり栄えているようだ。

　堀を橋で超えて、領主館の敷地へと入っていく。
　その門のところで一度、顔を確認される。

「ゴブリン……ですね、はい。通っていいですよ」

　話はちゃんと通っているらしい。
　馬車の窓から顔を出して、ニコニコしておく。
　ゴブリンも笑えば笑顔になる。ちょっと怖いけど。

　そうして控室へと通してもらい、すぐに謁見になった。
　謁見とはいっても、いわゆる玉座による対面式ではなく、応接室で行われることになっていた。
　先に部屋に通されて待つ。

「マーベルス侯爵がお会いになります」

　執事が入ってきて定番の台詞を言う。
　俺たちは立ち上がって、部屋に入ってくるのをじっと待つ。

　すぐに足音が聞こえてきて、部屋へと入ってくる。

「ようこそ、マーベルスへ。わざわざすまないね」
「あ、どうもどうも」
「ゴブリン、なんだね。本当に」
「あ、はい」
「えっと辺境の村シャーリア村のさらに先に住んでいるとか？」
「そうです。エルヘレス森の中腹にある崖の洞窟に住んでおります」
「なるほど。やっぱり原住民みたいな生活を？」
「それが、最近、交易をはじめたので、ちょっと人間臭くなってきました」
「あははは、人間臭いとは、ゴブリンなのだろう？」
「もちろんです」

「申し遅れました。エルヘレス森ルフガル洞窟のベダの息子、長のドルと申します」
「アーノルド・マーベルス侯爵という」

　とまあ雑談は進んでいく。

「お土産をお持ちしています」
「確認を」
「はい」

　執事さんが回収していく。

「製塩を一袋。スパイダーシルク一着分相当ですかな。それから宝石、あと魔石ですね」
「ふむ。高価な物ばかりだが」
「はい。せっかくのお土産なので」
「それは有難いが」
「ゴブリンの生活にはほとんど使わないものばかりなので」
「なるほど」

「魔石はオークの魔石がひとつございます」
「オークは中級の魔物だが、ゴブリンが？」
「はい。手負いでしたので仕留めたと聞いております」
「そうか。しかしゴブリンがオークを倒すのか、ふむ」

　戦力として見ているのだろうか。
　それとも俺たちが人間を襲うとしたらという考えだろうか。
　少し緊張するが、顔は笑っているので、大丈夫だろう。
　ただ好奇心が強いという話は本当のようだ。

「オークは一匹だったそうで、そこを複数のゴブリンの集団で倒せば、犠牲は出ますが、倒せないことはないかと」
「そうか」
「それに加え、今は人間製の防具、槍などを装備しており、当時よりみな強くなっています」
「そうかそうか」

　領主様はちょっと嬉しそうに笑う。

「街道を通ってきたと思うが、実は途中でオークの被害はたびたび起きていてな」
「そうなのですか」
「そうだ。ゴブリンでも倒せるというのは、人間にとってはいい話だ」
「私たちの共通の敵ですからね」
「そうだな」

　なぜかオークも豚人族という亜人にカウントされるものの、人間を特に嫌っている。
　そういう宗教観というかそういうものとしかいいようがない。
　人間と一緒に暮らせるビジョンが浮かばないのがオークというものだった。
　一方、ゴブリンは奴隷ではあるものの、人間と共存しているともいえる。

「実は、ゴブリン村の戦士が五名、最近も謎の死を迎えていて、どうもオークの犠牲になったのではと考えています」
「そうか、やはり」
「はい。オークは強暴ですし、私たちの敵です。お肉は美味しいんですけどね」
「そうだな」

　そういえば人間やゴブリンはオークを食べる。
　そりゃ嫌われても当然かもしれない。
　食べ物と共存は難しい話だ。

　一方、ゴブリンは不味いらしい。
　ゴブリン自身もオークも人間も、ゴブリンは食べない。
　オオカミはゴブリンも食べるようだが、何が違うのかは分からない。

「お土産はいただいた。よくきてくれた」
「ははっ」
「ルフガル洞窟のベダの息子、ドル。そなたをナイトに任命する。ゴブリン村の長として今後も励むように」
「有難き、幸せでございます」
「ゴブリンがオーラル王国の騎士爵以上に任命された例はこれがはじめてのはずだ」
「さようですか」
「ああ。我々はルフガルのゴブリンと同盟を組む。お互い良い関係を築こうじゃないか」
「はい、そうしたいです」

「規則があってややこしいのだが、税金はお土産の代金で賄うので今年は免除とする」
「はい」
「それで申し訳ないのだが、五名ほど戦士を戦力として出す必要がある。勤務地はデデム町だな」
「わかりました」
「五名でも出費だが、よろしく頼む」

　そうか徴兵ではないけれど、常備軍の戦力としてカウントされるのね。
　まあ国の一部に組み込まれるということはそういうことなのだろう。
　五名ならなんとか出せない規模ではない。

　こうして俺たちは国の一部として認められ、その傘下に入ることになった。
　ゴブリンの奴隷狩りからも名目上だけど保護されることになった。
　これにて俺たちに討伐隊が出るということはなくなったのだ。

　また来た道を戻ってゴブリン村まで帰って行った。

　ちなみに騎士爵のナイトだけは各領主の権限で与えることができる。
　しかし騎士爵という名前には反して爵位にカウントされない。
　男子伯侯公爵の五爵は国王の専任事項となっている。
　いつかはゴブリンの貴族なんてなってみたいかもしれない、などと思っていたが、実際に村長レベルのナイトになると、何だか複雑な思いだ。
　辺境も辺境の男爵とかもやってみたい。

「ゴブリン男爵」

　その語感が何だか面白くて、何回か反芻してみる。
　今はナイトで世襲もない。
　正式な貴族「ゴブリン男爵」そういうのも、悪くはないかもしれない。

■第17話　ゴブリン準騎士

　村や町から出される兵士は志願兵や徴兵とは異なり、準騎士と呼ばれる。
　俺はデレ。五名のゴブリン準騎士の第一陣のリーダーだった。

　ガルドに案内役を頼んだ。
　ゴブリン村、ルフガル洞窟を出てシャーリア村に一泊した後、デデム町へと行った。

　デデム町は栄えているとも過疎ともいえない。
　シャーリア村の倍以上デカいが、ごった返すほどではなかった。
　思ったよりはこぢんまりとした町という印象が強い。
　この町はマーベルス侯爵の直轄領で代官を置いている。

　ガルドに連れられて町役場まで出向いた。

「どうも、今度準騎士になったゴブリンです」
「あぁ、あんたらが。確かにゴブリンだな」
「見りゃわかるでしょ」
「そうだが。信じられねぇ。なんたって準騎士だぞ」
「まあそうだが」

　半信半疑の町役場の人にへこへこ頭を下げて、俺たちの上司や宿舎を案内してもらう。
　これから俺たちは三食飯がタダで食えて、給金が出る。
　普通の奴隷階級のゴブリンから見たら「羨ましい」の一言だろう。

　上司はこういった。

「ゴブリンねぇ。まあいいや。模擬戦して」
「わかりましたべ」
「俺たちのほうが強いに決まっているがな」
「どうでしょうね」

　こうして俺たちゴブリン小隊と人間の小隊とで模擬戦になった。
　戦闘方法は俺たちが提案した集団戦だ。
　単独で戦ったら、体格で劣るゴブリンが弱いに決まっている。
　という意見は両者で一致していたので、俺たちの言い分が通った。

「うりゃああ」
「おりゃあ」
「ういやぁ」
「おらおらおら」

　ゴブリン小隊は果敢に槍で攻めていく。
　対する人間は最初余裕の表情をしていたが、気が付いたらゴブリン小隊の槍部隊に囲まれていた。
　そうして槍をうまく巧みに扱うゴブリンたちに人間たちが降参した。

「ま、まいった」
「ほう」

　上官である隊長は面白そうな顔をしていた。

　だがそもそも俺たちは森の中で一年以上戦ってきた戦士なのだ。
　ウサギだけじゃない。オオカミとも何度も戦闘している。
　この前はイノシシとも戦闘をした経験がある。
　訓練だけしてる田舎の準騎士なんかよりよほど強いはずなのだ。
　ということで実戦豊富な俺たちは、思ったよりずっと強いらしい。

　やることといえば、町の巡回だった。
　俺たちはゴブリンで城門のチェック係は、常識がないとして回ってこないことになった。
　表の仕事は人間のモノというのが常識だからだ。
　まあ学がないのは事実なので、こればかりはしょうがない。

　そうして槍を装備した五人のゴブリンは町の中で歩いて回る。

「みてみてゴブリン」
「あら、槍なんて装備して嫌ね」

　はじめこそ拒否反応は強かったが、俺たちが無害であると分かるとだんだんと町の雰囲気も変わっていった。
　それに俺たちは横暴な準騎士が多い中で、何も分かっていなかったため対応が丁寧で人当たりがいいとして人気が上がっていった。

「ゴブリンさん」
「あら、今日もゴブリンさんたちが見守ってくれているわ」

　背も低い分、威圧的でないのも好条件だった。
　俺たちは次第に町の住民にも受け入れられ「ゴブリン準騎士」といえば立派な準騎士の鏡とさえ言われるようになった。

　小さい割には強い。
　強い割には物腰が丁寧。
　ゴブリン準騎士は紳士だ。

　まず酒や娼館通いなどの遊びをそもそも知らなかったことも大きい。
　何事もなく仕事をして飯を食って寝る。
　それだけで十分充実していたのだ。
　飯が上手ければやる気にはなる。
　俺たちはゴブリン村を代表しているという自負もあったし、ドルの面子をつぶすわけにはいかない。

　こうしてそうして、勤務してあっという間の半年間。
　すっかりデデム町でも馴染んでいたころ、血税期間が終わりを迎えた。

　俺デレたちはまたゴブリン村へ戻るのだ。
　村には仲間たちが待っている。
　最後の日。

「ほらほら、飲め飲め、あ悪い。ゴブリンは飲まないんだったな」
「ああ」
「んじゃ、食え食え」
「もちろん」

　デデム町の住民に促されて美味しい飯をおごってもらった。
　そしてゴブリンの謎の踊りと歌を披露した。
　これがゴブリン流のおもてなしだった。

「いいぞ、ゴブリンのだんな！」
「歌ったり、踊ったり、するんだねぇ」
「よっ、その調子」

　夜遅くまで続いた、宴はなかかに盛況だった。

　町の中には奴隷階級のゴブリンもいる。
　地方都市には比較的少ないものの、皆無ではない。
　それでも我らゴブリン準騎士たちは己の名誉のため、ゴブリン村のため、命を懸けて戦士の仕事をしている。
　それは森の中のルフガルでもデデム町でも変わることがないのだった。

（終わり）
`;
